###################################################################

# Created by write_sdc on Wed Oct 28 16:52:37 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports vout]
set_load -pin_load 3.40189 [get_ports {Dout[7]}]
set_load -pin_load 3.40189 [get_ports {Dout[6]}]
set_load -pin_load 3.40189 [get_ports {Dout[5]}]
set_load -pin_load 3.40189 [get_ports {Dout[4]}]
set_load -pin_load 3.40189 [get_ports {Dout[3]}]
set_load -pin_load 3.40189 [get_ports {Dout[2]}]
set_load -pin_load 3.40189 [get_ports {Dout[1]}]
set_load -pin_load 3.40189 [get_ports {Dout[0]}]
create_clock [get_ports clk]  -name my_clk  -period 14.52  -waveform {0 7.26}
set_clock_uncertainty 0.07  [get_clocks my_clk]
set_input_delay -clock my_clk  -max 0.5  [get_ports rst]
set_input_delay -clock my_clk  -max 0.5  [get_ports vin]
set_input_delay -clock my_clk  -max 0.5  [get_ports {Din[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {Din[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {Din[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {Din[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {Din[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {Din[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {Din[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {Din[0]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {b0[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {b0[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {b0[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {b0[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {b0[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {b0[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {b0[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {b0[0]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {a1[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {a1[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {a1[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {a1[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {a1[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {a1[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {a1[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {a1[0]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports vout]
set_output_delay -clock my_clk  -max 0.5  [get_ports {Dout[7]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {Dout[6]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {Dout[5]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {Dout[4]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {Dout[3]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {Dout[2]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {Dout[1]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {Dout[0]}]
