###################################################################

# Created by write_sdc on Fri Oct 30 18:24:22 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {y[7]}]
set_load -pin_load 3.40189 [get_ports {y[6]}]
set_load -pin_load 3.40189 [get_ports {y[5]}]
set_load -pin_load 3.40189 [get_ports {y[4]}]
set_load -pin_load 3.40189 [get_ports {y[3]}]
set_load -pin_load 3.40189 [get_ports {y[2]}]
set_load -pin_load 3.40189 [get_ports {y[1]}]
set_load -pin_load 3.40189 [get_ports {y[0]}]
set_load -pin_load 3.40189 [get_ports vout]
create_clock [get_ports clk]  -name my_clk  -period 9.2  -waveform {0 4.6}
set_clock_uncertainty 0.07  [get_clocks my_clk]
set_input_delay -clock my_clk  -max 0.5  [get_ports rst]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[0]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1[0]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {C[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {C[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {C[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {C[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {C[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {C[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {C[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {C[0]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A_sqrd[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A_sqrd[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A_sqrd[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A_sqrd[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A_sqrd[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A_sqrd[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A_sqrd[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A_sqrd[0]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports Vin]
set_input_delay -clock my_clk  -max 0.5  [get_ports {x[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {x[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {x[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {x[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {x[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {x[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {x[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {x[0]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {y[7]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {y[6]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {y[5]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {y[4]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {y[3]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {y[2]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {y[1]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {y[0]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports vout]
